  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/add-vms` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/49d978be-2e9a-4539-83ea-e0184a76ddb8/terraform-bin apply -no-color -auto-approve -compact-warnings
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

# module.k8s-cp[0].azurerm_linux_virtual_machine.vm must be replaced
-/+ resource "azurerm_linux_virtual_machine" "vm" {
    ~ computer_name                   = "k8s-cp-0" -> (known after apply)
    - encryption_at_host_enabled      = false -> null
    ~ id                              = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Compute/virtualMachines/k8s-cp-0" -> (known after apply)
      name                            = "k8s-cp-0"
    ~ private_ip_address              = "10.0.0.5" -> (known after apply)
    ~ private_ip_addresses            = [
        - "10.0.0.5",
      ] -> (known after apply)
    ~ public_ip_address               = "20.253.6.182" -> (known after apply)
    ~ public_ip_addresses             = [
        - "20.253.6.182",
      ] -> (known after apply)
    - secure_boot_enabled             = false -> null
    - tags                            = {} -> null
    ~ virtual_machine_id              = "0a5bc41f-c516-477d-be1b-f02414042e77" -> (known after apply)
    - vtpm_enabled                    = false -> null
      # (14 unchanged attributes hidden)

    ~ os_disk {
        ~ disk_size_gb              = 30 -> (known after apply)
        ~ name                      = "k8s-cp-0_OsDisk_1_6f5c3753a39d405e8be2f33daf6c0291" -> (known after apply)
          # (3 unchanged attributes hidden)
      }

    ~ source_image_reference {
        ~ offer     = "0001-com-ubuntu-server-focal" -> "0001-com-ubuntu-server-jammy" # forces replacement
        ~ sku       = "20_04-lts" -> "22_04-lts" # forces replacement
          # (2 unchanged attributes hidden)
      }

      # (1 unchanged block hidden)
  }

# module.k8s-node[0].azurerm_linux_virtual_machine.vm must be replaced
-/+ resource "azurerm_linux_virtual_machine" "vm" {
    ~ computer_name                   = "k8s-node-0" -> (known after apply)
    - encryption_at_host_enabled      = false -> null
    ~ id                              = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Compute/virtualMachines/k8s-node-0" -> (known after apply)
      name                            = "k8s-node-0"
    ~ private_ip_address              = "10.0.0.4" -> (known after apply)
    ~ private_ip_addresses            = [
        - "10.0.0.4",
      ] -> (known after apply)
    ~ public_ip_address               = "20.253.7.36" -> (known after apply)
    ~ public_ip_addresses             = [
        - "20.253.7.36",
      ] -> (known after apply)
    - secure_boot_enabled             = false -> null
    - tags                            = {} -> null
    ~ virtual_machine_id              = "18a3a80d-15f8-48d3-ac9e-5fdc192cbefd" -> (known after apply)
    - vtpm_enabled                    = false -> null
      # (14 unchanged attributes hidden)

    ~ os_disk {
        ~ disk_size_gb              = 30 -> (known after apply)
        ~ name                      = "k8s-node-0_OsDisk_1_90a3f2bf74314df7acfdaa954deac6b3" -> (known after apply)
          # (3 unchanged attributes hidden)
      }

    ~ source_image_reference {
        ~ offer     = "0001-com-ubuntu-server-focal" -> "0001-com-ubuntu-server-jammy" # forces replacement
        ~ sku       = "20_04-lts" -> "22_04-lts" # forces replacement
          # (2 unchanged attributes hidden)
      }

      # (1 unchanged block hidden)
  }

Plan: 2 to add, 0 to change, 2 to destroy.
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Compute/virtualMachines/k8s-node-0]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Compute/virtualMachines/k8s-cp-0]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...oft.Compute/virtualMachines/k8s-node-0, 10s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...osoft.Compute/virtualMachines/k8s-cp-0, 10s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Destruction complete after 18s
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Creating...
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...oft.Compute/virtualMachines/k8s-node-0, 20s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [10s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...oft.Compute/virtualMachines/k8s-node-0, 30s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [20s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...oft.Compute/virtualMachines/k8s-node-0, 40s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [30s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...oft.Compute/virtualMachines/k8s-node-0, 50s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Destruction complete after 50s
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Creating...
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [40s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [10s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Still creating... [50s elapsed]
module.k8s-cp[0].azurerm_linux_virtual_machine.vm: Creation complete after 50s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Compute/virtualMachines/k8s-cp-0]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [20s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [30s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Still creating... [40s elapsed]
module.k8s-node[0].azurerm_linux_virtual_machine.vm: Creation complete after 48s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Compute/virtualMachines/k8s-node-0]

Apply complete! Resources: 2 added, 0 changed, 2 destroyed.
```

  </details>